Revit 2025 API
WireDistributionDirection Enumeration
 Defines the direction of the distribution of wires in a Fabric Sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum WireDistributionDirection
Public Enumeration WireDistributionDirection
public enum class WireDistributionDirection
type WireDistributionDirection
Members
Member name | Value | Description
Major | 0 |  Wires are distributed in the Major direction. Uncomment following for 2020.1 text "Major"
Minor | 1 |  Wires are distributed in the Minor direction. Uncomment following for 2020.1 text "Minor"
See Also
Reference
Autodesk.Revit.DB.Structure Namespace